def show_plane(obj):
        print("Модель: {}; id: {}; К-сть сидінь: {}".format(obj[0],
                                                            obj[1],
                                                            obj[2]))


def show_flight(obj):
        print("Id літака: {}, Номер рейсу: {}; К-сть доступних місць: {}; " \
              "Призначення: {}; Дата посадки: {};" \
              " Час посадки: {}; Дата прибуття: {};" \
              " Час прибуття: {}; Ціна квитка: {}; Проміжні посадки: {}".format(obj[0],
                                                                                 obj[1],
                                                                                 obj[2],
                                                                                 obj[3],
                                                                                 obj[4],
                                                                                 obj[5],
                                                                                 obj[6],
                                                                                 obj[7],
                                                                                 obj[8],
                                                                                 ", ".join(obj[9])))


def show_ticket(obj):
        print("ПІБ: {}; номер рейсу: {};" \
              " Номер сидіння: {}; Ціна квитка: {}".format(obj[0],
                                                           obj[1],
                                                           obj[2],
                                                           obj[3], ))

def display_time(obj):
    print("Дата посадки: {}; Час посадки: {}; Дата прибуття: {}; Час прибуття: {}".format(obj[0],
                                                                                          obj[1],
                                                                                          obj[2],
                                                                                          obj[3]))